{
  "CS5e.Title": "Combat Simulator for 5e",
  "CS5e.Description": "No more TPKs or Walkovers - tune your encounters to be challenging and exciting!",
  "CS5e.id": "combat-simulator",
  "CS5e.TOKEN.Friendly": "Friendly",
  "CS5e.TOKEN.Hostile": "Hostile",
  "CS5e.Fight": "Fight!",
  "CS5e.Simulate": "Simulate",
  "CS5e.BUTTON.Title": "Simulate the current encounter",
  "CS5e.SETTING.Simulate.Name": "Begin Combat -> Simulate Encounter",
  "CS5e.SETTING.Simulate.Hint": "In the Combat Tracker, the Begin Combat button changes to Simulate; click to see the results of simulating the current Encounter",
  "CS5e.SETTING.NumberOfSimulations.Name": "Number of simulations",
  "CS5e.SETTING.NumberOfSimulations.Hint": "How many encounter simulations to run (default is 100); for each simulation combat continues until either the Friendly or the Hostile combatants are defeated",
  "CS5e.SETTING.ShowCombatDetail.Name": "Show combat detail",
  "CS5e.SETTING.ShowCombatDetail.Hint": "In detail mode, shows every attack, spell, saving throw, etc. for each actor. Not suggested for more than 10 simulations.",
  "CS5e.SETTING.ShowCombatDetail.Summary": "Summary",
  "CS5e.SETTING.ShowCombatDetail.Detail": "Detail",
  "CS5e.ERROR.CreateEncounterFirst": "Please create an encounter before using Combat Simulator",
  "CS5e.ERROR.NeedBothSides": "Make at least one Token Hostile and one Friendly for a valid simulation",
  "CS5e.INFO.DMGDifficulty" : "DMG-predicted difficulty (from DMG pg 82):",
  "CS5e.INFO.MoreAboutDMG" : "The DMG, Kobold Fight Club, and other Encounter Builders all use variants of the method recommended on page 82 of the DMG which uses XP thresholds and various adjustments based on number of party members and number of opponents. As we all know, one well-placed fireball can completely change the outcome of a supposedly easy or deadly fight. If you want to know how your party will <b>really</b> do, with their actual initiative, skills, feats, and magic items, you need to simulate the encounter enough times to see what happens most of the time. <b>That's what Combat Simulator for 5e does</b>",
  "CS5e.INFO.SimulationDifficulty" : "Actual difficulty from simulation (details below):",
  "CS5e.INFO.Rerun": "To tune your Encounter, leave this window open. Then change your actors in the Combat Tracker and click Simulate again."
}
